Revit 2024 API
HomeCamera.Center Property
 The zoom or orbit center.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ Center { get; }
Visual Basic
Public ReadOnly Property Center As XYZ
	Get
Visual C++
public:
property XYZ^ Center {
	XYZ^ get ();
}
See Also
HomeCamera Class
Autodesk.Revit.DB Namespace